{
  "get-app-context": {
    "description": "Get SMM context:\n  * The media folder user selected/focused on SMM UI\n  * The language in user preferences"
  },
  "is-folder-exist": {
    "description": "Check if a folder exists at the specified path. Accepts paths in POSIX or Windows format."
  },
  "get-media-folders": {
    "description": "Get the media folders that are managed by SMM. Returns an array of folder paths."
  },
  "list-files": {
    "description": "List all files in a folder recursively. Accepts paths in POSIX or Windows format. Returns file paths in POSIX format. Supports optional filter pattern for filtering results."
  },
  "get-media-metadata": {
    "description": "Get cached media metadata for a folder. Returns metadata including type, TMDB ID, name, and seasons."
  },
  "rename-folder": {
    "description": "Rename a media folder. This is a destructive operation - the folder will be renamed on disk and metadata cache will be updated."
  },
  "begin-rename-task": {
    "description": "Begin a rename files task for a media folder. Call this first, then addRenameFileToTask for each file, then endRenameFilesTask. The user will be asked to confirm before files are renamed. Returns a task ID to use with addRenameFileToTask and endRenameFilesTask."
  },
  "add-rename-file-to-task": {
    "description": "Add video file to rename. This tool is only for video file that linked to an episode."
  },
  "end-rename-task": {
    "description": "End the construction of the task. SMM will process the task in its own process."
  },
  "begin-rename-task-v2": {
    "description": "Begin a rename task for episode video file in a media folder. This tool is only for video files. This tool returns a task id, which is required for subsequent add-rename-episode-video-file and end-rename-episode-video-file-task calls."
  },
  "add-rename-file-to-task-v2": {
    "description": "Add a file rename (from/to) to an existing rename task V2. Call this after beginRenameFilesTaskV2 for each file to rename. You DO NOT need to add thumbnail, subtitle, or nfo files; they are renamed when the main video is renamed."
  },
  "end-rename-task-v2": {
    "description": "End a rename task V2 and notify the UI that the plan is ready for review. The plan is persisted and the user will see a confirm/cancel prompt in the UI. The chat is not blocked. Call this after adding all files with addRenameFileToTaskV2. The task must have at least one file."
  },
  "begin-recognize-task": {
    "description": "Begin a media file recognition task for a media folder. This tool creates a new task that allows you to collect multiple recognized media files before presenting the complete plan to the user for review. You should call this tool first, then use addRecognizedMediaFile to add recognized files, and finally call endRecognizeTask to notify the UI that the plan is ready. Example: Begin a recognition task for folder \"/path/to/media/folder\". This tool returns a task ID that you must use with addRecognizedMediaFile and endRecognizeTask."
  },
  "add-recognized-media-file": {
    "description": "Add a recognized media file to an existing recognition task. This tool adds a single recognized file (with season, episode, and path) to a task that was created with beginRecognizeTask. You can call this tool multiple times to add multiple files to the same task. Example: Add a recognized file to task \"task-id-123\" with season 1, episode 5, and path \"/path/to/file.mp4\"."
  },
  "end-recognize-task": {
    "description": "End a recognition task and notify the UI that the plan is ready for review. This tool reads the final recognition plan and broadcasts a Socket.IO event to notify the UI. Example: End task \"task-id-123\" to notify the UI that the recognition plan is ready."
  },
  "how-to-rename-episode-video-files": {
    "description": "The instruction for renaming episode video files. Call this tool when user ask to rename files or episode."
  },
  "get-episodes": {
    "description": "Get all episodes for a TV show with their video file paths. Combines TMDB episode data with local media file paths. For each episode, returns season, episode number, title, and video file path (which may be undefined if the episode hasn't been recognized yet)."
  },
  "readme": {
    "description": "MUST call this tool to get SMM MCP tools document before calling other SMM MCP tools"
  }
}
